<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"></ul></div>

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data = DataFrame(np.arange(12).reshape((3, 4)),
                 index=['Ohio', 'Colorado', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [3]:
# 取前4个字符，再将其大写
transform = lambda x: x[:4].upper()

In [4]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [5]:
data.index = data.index.map(transform)

In [6]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [7]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [8]:
data.rename(index={'OHIO': 'INDIANA'}, # 将index中的'OHIO'改为'INDIANA'
            columns={'three': 'peekaboo'}) # 将columns中的'three'改为'peekaboo'

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [9]:
data.rename(index={'OHIO': 'INDIANA'}, # 将index中的'OHIO'改为'INDIANA'
            inplace=True) # 原地修改

In [10]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11